In [1]:
import pandas as pd

In [3]:
df_products = pd.read_csv('product.csv')

In [5]:
df_products.head()

,ProductKey,Product,Standard Cost,Color,Subcategory,Category
0,210,"HL Road Frame - Black, 58",$868.63,Black,Road Frames,Components
1,215,"Sport-100 Helmet, Black",$12.03,Black,Helmets,Accessories
2,216,"Sport-100 Helmet, Black",$13.88,Black,Helmets,Accessories
3,217,"Sport-100 Helmet, Black",$13.09,Black,Helmets,Accessories
4,253,"LL Road Frame - Black, 58",$176.2,Black,Road Frames,Components

In [8]:
df_products.columns = df_products.columns.str.replace(' ', '_').str.lower()

In [9]:
df_products.columns

Index(['productkey', 'product', 'standard_cost', 'color', 'subcategory',
       'category'],
      dtype='object')

In [19]:
df_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   productkey     397 non-null    int64
 1   product        397 non-null    object
 2   standard_cost  397 non-null    float64
 3   color          341 non-null    object
 4   subcategory    397 non-null    object
 5   category       397 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 18.7+ KB

In [12]:
df_products['standard_cost'] = df_products['standard_cost'].str.replace('$', '')

In [15]:
df_products.head()

,productkey,product,standard_cost,color,subcategory,category
0,210,"HL Road Frame - Black, 58",868.63,Black,Road Frames,Components
1,215,"Sport-100 Helmet, Black",12.03,Black,Helmets,Accessories
2,216,"Sport-100 Helmet, Black",13.88,Black,Helmets,Accessories
3,217,"Sport-100 Helmet, Black",13.09,Black,Helmets,Accessories
4,253,"LL Road Frame - Black, 58",176.2,Black,Road Frames,Components

In [18]:
df_products['standard_cost'] = df_products['standard_cost'].str.replace(',', '').astype(float)

In [20]:
df_products.to_csv('product_cleaned.csv', index=False)

In [21]:
df_region = pd.read_csv('region.csv')

In [24]:
df_region.head(40)

   SalesTerritoryKey          Region         Country          Group
0                  1       Northwest   United States  North America
1                  2       Northeast   United States  North America
2                  3         Central   United States  North America
3                  4       Southwest   United States  North America
4                  5       Southeast   United States  North America
5                  6          Canada          Canada  North America
6                  7          France          France         Europe
7                  8         Germany         Germany         Europe
8                  9       Australia       Australia        Pacific
9                 10  United Kingdom  United Kingdom         Europe

In [25]:
df_region.columns = df_region.columns.str.replace(' ', '_').str.lower()

In [26]:
df_region.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   salesterritorykey  10 non-null     int64
 1   region             10 non-null     object
 2   country            10 non-null     object
 3   group              10 non-null     object
dtypes: int64(1), object(3)
memory usage: 452.0+ bytes

In [27]:
df_region.to_csv('region_cleaned.csv', index=False)

In [28]:
df_reseller = pd.read_csv('reseller.csv')
df_reseller.head()

,ResellerKey,Business Type,Reseller,City,State-Province,Country-Region
0,277,Specialty Bike Shop,The Bicycle Accessories Company,Alhambra,California,United States
1,455,Value Added Reseller,Timely Shipping Service,Alpine,California,United States
2,609,Value Added Reseller,Good Toys,Auburn,California,United States
3,492,Specialty Bike Shop,Basic Sports Equipment,Baldwin Park,California,United States
4,365,Specialty Bike Shop,Distinctive Store,Barstow,California,United States

In [29]:
df_reseller.shape

(701, 6)

In [32]:
df_reseller.columns = df_reseller.columns.str.replace('-', '_').str.replace(' ','_').str.lower()

In [33]:
df_reseller.columns

Index(['resellerkey', 'business_type', 'reseller', 'city', 'state_province',
       'country_region'],
      dtype='object')

In [34]:
df_reseller.to_csv('reseller_cleaned.csv', index=False)

In [35]:
df

NameError: name 'df' is not defined

In [36]:
df_sales = pd.read_csv('sales.csv')
df_sales.head()

,SalesOrderNumber,OrderDate,ProductKey,ResellerKey,EmployeeKey,SalesTerritoryKey,Quantity,Unit Price,Sales,Cost
0,SO43897,25-08-2017,235,312,282,4,2,28.84,57.68,63.45
1,SO43897,25-08-2017,351,312,282,4,2,2024.99,4049.98,3796.19
2,SO43897,25-08-2017,348,312,282,4,2,2024.99,4049.98,3796.19
3,SO43897,25-08-2017,232,312,282,4,2,28.84,57.68,63.45
4,SO44544,18-11-2017,292,312,282,4,2,818.70,1637.40,1413.62

In [37]:
df_sales.columns = df_sales.columns.str.replace(' ', '_').str.lower()
df_sales.columns

Index(['salesordernumber', 'orderdate', 'productkey', 'resellerkey',
       'employeekey', 'salesterritorykey', 'quantity', 'unit_price', 'sales',
       'cost'],
      dtype='object')

In [38]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57851 entries, 0 to 57850
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   salesordernumber   57851 non-null  object
 1   orderdate          57851 non-null  object
 2   productkey         57851 non-null  int64
 3   resellerkey        57851 non-null  int64
 4   employeekey        57851 non-null  int64
 5   salesterritorykey  57851 non-null  int64
 6   quantity           57851 non-null  int64
 7   unit_price         57851 non-null  float64
 8   sales              57851 non-null  float64
 9   cost               57851 non-null  float64
dtypes: float64(3), int64(5), object(2)
memory usage: 4.4+ MB

In [39]:
df_sales['orderdate'] = pd.to_datetime(df_sales['orderdate'])
df_sales['orderdate'].head()

C:\Users\New\AppData\Local\Temp\ipykernel_2852\2603185360.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df_sales['orderdate'] = pd.to_datetime(df_sales['orderdate'])

0   2017-08-25
1   2017-08-25
2   2017-08-25
3   2017-08-25
4   2017-11-18
Name: orderdate, dtype: datetime64[ns]

In [40]:
df_sales.shape

(57851, 10)

In [41]:
df_sales.tail()

,salesordernumber,orderdate,productkey,resellerkey,employeekey,salesterritorykey,quantity,unit_price,sales,cost
57846,SO69476,2020-05-15,476,667,283,2,21,38.49,808.29,549.70
57847,SO69476,2020-05-15,474,667,283,2,19,38.49,731.31,497.35
57848,SO69493,2020-05-18,482,89,283,2,20,4.94,98.80,67.25
57849,SO69503,2020-05-20,482,79,282,3,23,4.94,113.62,77.33
57850,SO69561,2020-05-31,474,546,282,3,26,35.00,910.00,680.58

In [42]:
df_sales.to_csv('sales_cleaned.csv', index=False)

In [43]:
df_salesperson = pd.read_csv('salesperson.csv')

In [44]:
df_salesperson.head()

,EmployeeKey,EmployeeID,Salesperson,Title,UPN
0,272,502097814,Stephen Jiang,North American Sales Manager,stephen-jiang@adventureworks.com
1,277,112432117,Brian Welcker,Director of Sales,brian-welcker@adventureworks.com
2,281,841560125,Michael Blythe,Sales Representative,michael-blythe@adventureworks.com
3,282,191644724,Linda Mitchell,Sales Representative,linda-mitchell@adventureworks.com
4,283,615389812,Jillian Carson,Sales Representative,jillian-carson@adventureworks.com

In [46]:
df_salesperson.columns = df_salesperson.columns.str.replace(' ', '_').str.lower()
df_salesperson.columns

Index(['employeekey', 'employeeid', 'salesperson', 'title', 'upn'], dtype='object')

In [47]:
df_salesperson.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employeekey  18 non-null     int64
 1   employeeid   18 non-null     int64
 2   salesperson  18 non-null     object
 3   title        18 non-null     object
 4   upn          18 non-null     object
dtypes: int64(2), object(3)
memory usage: 852.0+ bytes

In [48]:
df_salesperson.shape

(18, 5)

In [49]:
df_salesperson.to_csv('salesperson_cleaned.csv', index=False)

In [51]:
df_salesperson_region = pd.read_csv('salespersonRegion.csv')
df_salesperson_region.head()

   EmployeeKey  SalesTerritoryKey
0          272                  1
1          272                  2
2          272                  3
3          272                  4
4          272                  5

In [53]:
df_salesperson_region.columns = df_salesperson_region.columns.str.replace(' ', '_').str.lower() 
df_salesperson_region.columns

Index(['employeekey', 'salesterritorykey'], dtype='object')

In [54]:
df_salesperson_region.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39 entries, 0 to 38
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   employeekey        39 non-null     int64
 1   salesterritorykey  39 non-null     int64
dtypes: int64(2)
memory usage: 756.0 bytes

In [55]:
df_salesperson_region.to_csv('salesperson_region_cleaned.csv', index=False)

In [60]:
df_target = pd.read_csv('Targets.csv')

df_target.head()

   EmployeeID  Target TargetMonth
0    90836195  500000  01-12-2017
1   112432117  500000  01-07-2017
2   139397894  500000  01-12-2017
3   191644724  500000  01-09-2017
4   502097814  500000  01-07-2017

In [61]:
df_target.columns = df_target.columns.str.replace(' ', '_').str.lower()
df_target.columns

Index(['employeeid', 'target', 'targetmonth'], dtype='object')

In [62]:
df_target['targetmonth'] = pd.to_datetime(df_target['targetmonth'],format='%d-%m-%Y')
df_target['targetmonth'].head()

0   2017-12-01
1   2017-07-01
2   2017-12-01
3   2017-09-01
4   2017-07-01
Name: targetmonth, dtype: datetime64[ns]

In [63]:
df_target.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 809 entries, 0 to 808
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employeeid   809 non-null    int64
 1   target       809 non-null    int64
 2   targetmonth  809 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(2)
memory usage: 19.1 KB

In [64]:
df_target.to_csv('target_cleaned.csv', index=False)